---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.TrussFailures
source: html/2769b48e-9af8-d17b-1ac9-9b2a7de594b8.htm
---
# BuiltInFailures.TrussFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.